stm32-rs/stm32l4xx-hal/src/serial.rs
//! Serial

use as_slice::AsMutSlice;
use cast::u16;
use core::fmt;
use core::marker::PhantomData;
use core::ops::DerefMut;
use core::ptr;
use core::sync::atomic::{self, Ordering};
use stable_deref_trait::StableDeref;

use crate::hal::serial::{self, Write};
use nb;

use crate::stm32::{USART1, USART2};

// TODO USART3RST is missing atm in stm32l4x1 & stm32l4x2 crate
// Related issue: https://github.com/stm32-rs/stm32-rs/issues/243
#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::stm32::USART3;

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::stm32::UART4;

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::stm32::UART5;

use crate::gpio::gpioa::{PA10, PA11, PA12, PA0, PA1, PA2, PA3, PA9};
use crate::gpio::gpiob::{PB3, PB4, PB6, PB7};
use crate::gpio::gpiod::{PD3, PD4, PD5, PD6};
use crate::gpio::{Alternate, Floating, Input, AF7};

#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpioa::{PA6};

#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpiob::{PB1, PB10, PB11, PB13, PB14};

#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpiod::{PD2, PD11, PD12};

#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpioc::{PC4, PC5, PC10, PC11};

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpioa::{PA15};

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpiob::{PB5};

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::gpioc::PC12;

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::gpio::AF8;

use crate::dma::{dma1, CircBuffer};
use crate::rcc::{Clocks, APB1R1, APB2};
use crate::time::{Bps, U32Ext};

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
use crate::dma::dma2;

/// Interrupt event
pub enum Event {
    /// New data has been received
    Rxne,
    /// New data can be sent
    Txe,
    /// The line has gone idle
    Idle,
}

/// Serial error
#[derive(Debug)]
pub enum Error {
    /// Framing error
    Framing,
    /// Noise error
    Noise,
    /// RX buffer overrun
    Overrun,
    /// Parity check error
    Parity,
    #[doc(hidden)]
    _Extensible,
}

pub trait Pins<USART> {
    const REMAP: u8;
    const FLOWCTL: bool;
}

macro_rules! pins {
    // Hardware flow control, Rx+Tx+Rts+Cts
    ($(
        $(#[$meta:meta])*
        $USARTX:ident: (
            $tx:ident,
            $rx:ident,
            $rts:ident,
            $cts:ident,
            $remap:tt,
            $af:ident
        ),
    )+) => {
        $(
            impl Pins<$USARTX> for ($tx<Alternate<$af, Input<Floating>>>, $rx<Alternate<$af, Input<Floating>>>, $rts<Alternate<$af, Input<Floating>>>, $cts<Alternate<$af, Input<Floating>>>) {
                const REMAP: u8 = $remap;
                const FLOWCTL: bool = true;
            }
        )+
    };
    // No flow control, just Rx+Tx
    ($(
        $(#[$meta:meta])*
        $USARTX:ident: (
            $tx:ident,
            $rx:ident,
            $remap:tt,
            $af:ident
        ),
    )+) => {
        $(
            impl Pins<$USARTX> for ($tx<Alternate<$af, Input<Floating>>>, $rx<Alternate<$af, Input<Floating>>>) {
                const REMAP: u8 = $remap;
                const FLOWCTL: bool = false;
            }
        )+
    };
}

// USART 1
pins! {
    // USART1: (tx: (PA9, PB6), rx: (PA10, PB7), rts: (PA12, PB3), cts: (PA11, PB4), 1, AF7),
    USART1: (PA9, PA10, 0, AF7),
    USART1: (PB6, PA10, 0, AF7),
    USART1: (PA9, PB7, 0, AF7),
    USART1: (PB6, PB7, 1, AF7),
}

pins! {
    USART1: (PA9, PA10, PA12, PA11, 0, AF7),
    USART1: (PA9, PA10, PA12, PB4, 0, AF7),
    USART1: (PA9, PA10, PB3, PA11, 0, AF7),
    USART1: (PA9, PA10, PB3, PB4, 0, AF7),
    USART1: (PB6, PA10, PA12, PA11, 0, AF7),
    USART1: (PB6, PA10, PA12, PB4, 0, AF7),
    USART1: (PB6, PA10, PB3, PA11, 0, AF7),
    USART1: (PB6, PA10, PB3, PB4, 0, AF7),
    USART1: (PA9, PB7, PA12, PA11, 0, AF7),
    USART1: (PA9, PB7, PA12, PB4, 0, AF7),
    USART1: (PA9, PB7, PB3, PA11, 0, AF7),
    USART1: (PA9, PB7, PB3, PB4, 0, AF7),
    USART1: (PB6, PB7, PA12, PA11, 1, AF7),
    USART1: (PB6, PB7, PA12, PB4, 1, AF7),
    USART1: (PB6, PB7, PB3, PA11, 1, AF7),
    USART1: (PB6, PB7, PB3, PB4, 1, AF7),
}

// USART 2
pins! {
    // USART2: (tx: (PA2, PD5), rx: (PA3, PD6), rts: (PA1, PD4), cts: (PA0, PD3), 0, AF7),
    USART2: (PA2, PA3, 0, AF7),
    USART2: (PD5, PA3, 0, AF7),
    USART2: (PA2, PD6, 0, AF7),
    USART2: (PD5, PD6, 0, AF7),
}

pins! {
    USART2: (PA2, PA3, PA1, PA0, 0, AF7),
    USART2: (PA2, PA3, PA1, PD3, 0, AF7),
    USART2: (PA2, PA3, PD4, PA0, 0, AF7),
    USART2: (PA2, PA3, PD4, PD3, 0, AF7),
    USART2: (PD5, PA3, PA1, PA0, 0, AF7),
    USART2: (PD5, PA3, PA1, PD3, 0, AF7),
    USART2: (PD5, PA3, PD4, PA0, 0, AF7),
    USART2: (PD5, PA3, PD4, PD3, 0, AF7),
    USART2: (PA2, PD6, PA1, PA0, 0, AF7),
    USART2: (PA2, PD6, PA1, PD3, 0, AF7),
    USART2: (PA2, PD6, PD4, PA0, 0, AF7),
    USART2: (PA2, PD6, PD4, PD3, 0, AF7),
    USART2: (PD5, PD6, PA1, PA0, 0, AF7),
    USART2: (PD5, PD6, PA1, PD3, 0, AF7),
    USART2: (PD5, PD6, PD4, PA0, 0, AF7),
    USART2: (PD5, PD6, PD4, PD3, 0, AF7),
}

// USART 3
#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    //  USART3: (tx: (PB10, PC4, PC10), rx: (PB11, PC5, PC11), rts: (PB1, PB14, PD2, PD12), cts: (PA6, PB13, PD11), 1, AF7),
    USART3: (PB10, PB11, 0, AF7),
    USART3: (PC4, PB11, 0, AF7),
    USART3: (PC10, PB11, 0, AF7),
    USART3: (PB10, PC5, 0, AF7),
    USART3: (PC4, PC5, 0, AF7),
    USART3: (PC10, PC5, 0, AF7),
    USART3: (PB10, PC11, 0, AF7),
    USART3: (PC4, PC11, 0, AF7),
    USART3: (PC10, PC11, 0, AF7),
}

#[cfg(any(feature = "stm32l4x3", feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    USART3: (PB10, PB11, PB1, PA6, 0, AF7),
    USART3: (PB10, PB11, PB1, PB13, 0, AF7),
    USART3: (PB10, PB11, PB1, PD11, 0, AF7),
    USART3: (PB10, PB11, PB14, PA6, 0, AF7),
    USART3: (PB10, PB11, PB14, PB13, 0, AF7),
    USART3: (PB10, PB11, PB14, PD11, 0, AF7),
    USART3: (PB10, PB11, PD2, PA6, 0, AF7),
    USART3: (PB10, PB11, PD2, PB13, 0, AF7),
    USART3: (PB10, PB11, PD2, PD11, 0, AF7),
    USART3: (PB10, PB11, PD12, PA6, 0, AF7),
    USART3: (PB10, PB11, PD12, PB13, 0, AF7),
    USART3: (PB10, PB11, PD12, PD11, 0, AF7),
    USART3: (PC4, PB11, PB1, PA6, 0, AF7),
    USART3: (PC4, PB11, PB1, PB13, 0, AF7),
    USART3: (PC4, PB11, PB1, PD11, 0, AF7),
    USART3: (PC4, PB11, PB14, PA6, 0, AF7),
    USART3: (PC4, PB11, PB14, PB13, 0, AF7),
    USART3: (PC4, PB11, PB14, PD11, 0, AF7),
    USART3: (PC4, PB11, PD2, PA6, 0, AF7),
    USART3: (PC4, PB11, PD2, PB13, 0, AF7),
    USART3: (PC4, PB11, PD2, PD11, 0, AF7),
    USART3: (PC4, PB11, PD12, PA6, 0, AF7),
    USART3: (PC4, PB11, PD12, PB13, 0, AF7),
    USART3: (PC4, PB11, PD12, PD11, 0, AF7),
    USART3: (PC10, PB11, PB1, PA6, 0, AF7),
    USART3: (PC10, PB11, PB1, PB13, 0, AF7),
    USART3: (PC10, PB11, PB1, PD11, 0, AF7),
    USART3: (PC10, PB11, PB14, PA6, 0, AF7),
    USART3: (PC10, PB11, PB14, PB13, 0, AF7),
    USART3: (PC10, PB11, PB14, PD11, 0, AF7),
    USART3: (PC10, PB11, PD2, PA6, 0, AF7),
    USART3: (PC10, PB11, PD2, PB13, 0, AF7),
    USART3: (PC10, PB11, PD2, PD11, 0, AF7),
    USART3: (PC10, PB11, PD12, PA6, 0, AF7),
    USART3: (PC10, PB11, PD12, PB13, 0, AF7),
    USART3: (PC10, PB11, PD12, PD11, 0, AF7),
    USART3: (PB10, PC5, PB1, PA6, 0, AF7),
    USART3: (PB10, PC5, PB1, PB13, 0, AF7),
    USART3: (PB10, PC5, PB1, PD11, 0, AF7),
    USART3: (PB10, PC5, PB14, PA6, 0, AF7),
    USART3: (PB10, PC5, PB14, PB13, 0, AF7),
    USART3: (PB10, PC5, PB14, PD11, 0, AF7),
    USART3: (PB10, PC5, PD2, PA6, 0, AF7),
    USART3: (PB10, PC5, PD2, PB13, 0, AF7),
    USART3: (PB10, PC5, PD2, PD11, 0, AF7),
    USART3: (PB10, PC5, PD12, PA6, 0, AF7),
    USART3: (PB10, PC5, PD12, PB13, 0, AF7),
    USART3: (PB10, PC5, PD12, PD11, 0, AF7),
    USART3: (PC4, PC5, PB1, PA6, 0, AF7),
    USART3: (PC4, PC5, PB1, PB13, 0, AF7),
    USART3: (PC4, PC5, PB1, PD11, 0, AF7),
    USART3: (PC4, PC5, PB14, PA6, 0, AF7),
    USART3: (PC4, PC5, PB14, PB13, 0, AF7),
    USART3: (PC4, PC5, PB14, PD11, 0, AF7),
    USART3: (PC4, PC5, PD2, PA6, 0, AF7),
    USART3: (PC4, PC5, PD2, PB13, 0, AF7),
    USART3: (PC4, PC5, PD2, PD11, 0, AF7),
    USART3: (PC4, PC5, PD12, PA6, 0, AF7),
    USART3: (PC4, PC5, PD12, PB13, 0, AF7),
    USART3: (PC4, PC5, PD12, PD11, 0, AF7),
    USART3: (PC10, PC5, PB1, PA6, 0, AF7),
    USART3: (PC10, PC5, PB1, PB13, 0, AF7),
    USART3: (PC10, PC5, PB1, PD11, 0, AF7),
    USART3: (PC10, PC5, PB14, PA6, 0, AF7),
    USART3: (PC10, PC5, PB14, PB13, 0, AF7),
    USART3: (PC10, PC5, PB14, PD11, 0, AF7),
    USART3: (PC10, PC5, PD2, PA6, 0, AF7),
    USART3: (PC10, PC5, PD2, PB13, 0, AF7),
    USART3: (PC10, PC5, PD2, PD11, 0, AF7),
    USART3: (PC10, PC5, PD12, PA6, 0, AF7),
    USART3: (PC10, PC5, PD12, PB13, 0, AF7),
    USART3: (PC10, PC5, PD12, PD11, 0, AF7),
    USART3: (PB10, PC11, PB1, PA6, 0, AF7),
    USART3: (PB10, PC11, PB1, PB13, 0, AF7),
    USART3: (PB10, PC11, PB1, PD11, 0, AF7),
    USART3: (PB10, PC11, PB14, PA6, 0, AF7),
    USART3: (PB10, PC11, PB14, PB13, 0, AF7),
    USART3: (PB10, PC11, PB14, PD11, 0, AF7),
    USART3: (PB10, PC11, PD2, PA6, 0, AF7),
    USART3: (PB10, PC11, PD2, PB13, 0, AF7),
    USART3: (PB10, PC11, PD2, PD11, 0, AF7),
    USART3: (PB10, PC11, PD12, PA6, 0, AF7),
    USART3: (PB10, PC11, PD12, PB13, 0, AF7),
    USART3: (PB10, PC11, PD12, PD11, 0, AF7),
    USART3: (PC4, PC11, PB1, PA6, 0, AF7),
    USART3: (PC4, PC11, PB1, PB13, 0, AF7),
    USART3: (PC4, PC11, PB1, PD11, 0, AF7),
    USART3: (PC4, PC11, PB14, PA6, 0, AF7),
    USART3: (PC4, PC11, PB14, PB13, 0, AF7),
    USART3: (PC4, PC11, PB14, PD11, 0, AF7),
    USART3: (PC4, PC11, PD2, PA6, 0, AF7),
    USART3: (PC4, PC11, PD2, PB13, 0, AF7),
    USART3: (PC4, PC11, PD2, PD11, 0, AF7),
    USART3: (PC4, PC11, PD12, PA6, 0, AF7),
    USART3: (PC4, PC11, PD12, PB13, 0, AF7),
    USART3: (PC4, PC11, PD12, PD11, 0, AF7),
    USART3: (PC10, PC11, PB1, PA6, 0, AF7),
    USART3: (PC10, PC11, PB1, PB13, 0, AF7),
    USART3: (PC10, PC11, PB1, PD11, 0, AF7),
    USART3: (PC10, PC11, PB14, PA6, 0, AF7),
    USART3: (PC10, PC11, PB14, PB13, 0, AF7),
    USART3: (PC10, PC11, PB14, PD11, 0, AF7),
    USART3: (PC10, PC11, PD2, PA6, 0, AF7),
    USART3: (PC10, PC11, PD2, PB13, 0, AF7),
    USART3: (PC10, PC11, PD2, PD11, 0, AF7),
    USART3: (PC10, PC11, PD12, PA6, 0, AF7),
    USART3: (PC10, PC11, PD12, PB13, 0, AF7),
    USART3: (PC10, PC11, PD12, PD11, 0, AF7),
}

// UART 4
#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    // UART4: (tx: (PA0, PC10), rx: (PA1, PC11), rts: (PA15), cts: (PB7), 1, AF8),
    UART4: (PA0, PA1, 0, AF7),
    UART4: (PC10, PA1, 0, AF7),
    UART4: (PA0, PC11, 0, AF7),
    UART4: (PC10, PC11, 0, AF7),
}

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    UART4: (PA0, PA1, PA15, PB7, 0, AF7),
    UART4: (PC10, PA1, PA15, PB7, 0, AF7),
    UART4: (PA0, PC11, PA15, PB7, 0, AF7),
    UART4: (PC10, PC11, PA15, PB7, 0, AF7),
}

// UART 5
#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    // UART5: (tx: (PC12), rx: (PD2), rts: (PB4), cts: (PB5), 1, AF8),
    UART5: (PC12, PD2, 0, AF8),
}

#[cfg(any(feature = "stm32l4x5", feature = "stm32l4x6",))]
pins! {
    UART5: (PC12, PD2, PB4, PB5, 0, AF8),
}

pub enum Parity {
    ParityNone,
    ParityEven,
    ParityOdd,
}

